# Exercise 6

In [9]:
import pandas as pd
import numpy as np
import seaborn as sns

In [10]:
np.__version__

'1.24.4'

In [12]:
pd.__version__

'2.0.3'

# 1

In [15]:
df = pd.DataFrame({
    'features': [1.4, 6.9, 8.7, 6.5, 9.2],
    'labels': [0,1,2,3,4]})
df

   features  labels
0       1.4       0
1       6.9       1
2       8.7       2
3       6.5       3
4       9.2       4

# 2

In [16]:
df.rename(columns={'labels': 'label'})

   features  label
0       1.4      0
1       6.9      1
2       8.7      2
3       6.5      3
4       9.2      4

# 3

In [22]:
iris = sns.load_dataset('iris')
iris.sort_values('species', ascending=False)

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

# 4

In [26]:
iris.species.value_counts().to_frame('counts')

            counts
species
setosa          50
versicolor      50
virginica       50

# 5

In [30]:
len(iris[(iris.petal_length <= 1.4) | (iris.petal_length >= 1.6)])

137

# 6

In [33]:
iris['min_petal']=iris.apply(lambda x: min(x.petal_length, x.petal_width), axis=1)

In [34]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  min_petal
0           5.1          3.5           1.4          0.2  setosa        0.2
1           4.9          3.0           1.4          0.2  setosa        0.2
2           4.7          3.2           1.3          0.2  setosa        0.2
3           4.6          3.1           1.5          0.2  setosa        0.2
4           5.0          3.6           1.4          0.2  setosa        0.2

In [35]:
iris.tail()

,sepal_length,sepal_width,petal_length,petal_width,species,min_petal
145,6.7,3.0,5.2,2.3,virginica,2.3
146,6.3,2.5,5.0,1.9,virginica,1.9
147,6.5,3.0,5.2,2.0,virginica,2.0
148,6.2,3.4,5.4,2.3,virginica,2.3
149,5.9,3.0,5.1,1.8,virginica,1.8

# 7

In [41]:
pd.pivot_table(iris, values=['sepal_width', 'petal_width'], columns=['species'], aggfunc = {np.mean,np.median}) 
#Braces groups rows, brackets group columns

species             setosa  versicolor  virginica
petal_width mean     0.246       1.326      2.026
            median   0.200       1.300      2.000
sepal_width mean     3.428       2.770      2.974
            median   3.400       2.800      3.000

In [42]:
pd.pivot_table(iris, values=['sepal_width', 'petal_width'], columns=['species'], aggfunc = {np.mean,np.median}).T 
#Transposed

           petal_width        sepal_width
                  mean median        mean median
species
setosa           0.246    0.2       3.428    3.4
versicolor       1.326    1.3       2.770    2.8
virginica        2.026    2.0       2.974    3.0

# 8

In [43]:
left = pd.DataFrame({'Name': ['John', 'Lily', 'Spencer'], 'Age':[12, 16, 9]})
left = left.set_index('Name')

In [44]:
right= pd.DataFrame({'Name': ['John', 'Lily', 'Spencer'], 'Height(in)':[60, 48, 45]})
right = right.set_index('Name')

In [45]:
inner = pd.merge(left,right, on='Name', how='inner')

In [46]:
inner

         Age  Height(in)
Name
John      12          60
Lily      16          48
Spencer    9          45

In [47]:
outer = left.join(right, how='outer')
outer

         Age  Height(in)
Name
John      12          60
Lily      16          48
Spencer    9          45

# 9

In [51]:
series = pd.Series([1,1,2,3,5,8])

In [55]:
vals = series.values
reshape = vals.reshape(2,3)
print(reshape)
print(reshape.shape)

[[1 1 2]
 [3 5 8]]
(2, 3)

# 10

In [56]:
cats = pd.DataFrame({'breed':['persian', 'persian', 'siamese', 'himalayan', 'burmese'],
                    'color': ['calico', 'white', 'seal point', 'cream', 'sable']})

In [58]:
dummy_cats = pd.get_dummies(cats, prefix=['b', 'c'])
dummy_cats

,b_burmese,b_himalayan,b_persian,b_siamese,c_calico,c_cream,c_sable,c_seal point,c_white
0,False,False,True,False,True,False,False,False,False
1,False,False,True,False,False,False,False,False,True
2,False,False,False,True,False,False,False,True,False
3,False,True,False,False,False,True,False,False,False
4,True,False,False,False,False,False,True,False,False